tomyqg/STM32_RTT_F107/ECU/main/src/zigbee.c
	return 0;
}

int compare_protect_data(char *set_protect_data, char *actual_protect_data)				//比较逆变器返回的预设值和页面上输入的预设值
{
	int i;

	for(i=0; i<12; i++)
	{
		if(set_protect_data[i] != actual_protect_data[i])
			return -1;
	}

	return 0;
}

int resolve_presetdata(inverter_info *inverter, char * protect_data_result)	//?????????????
{
	float temp;

	/*if(1 == ecu.type)
		temp = (presetdata[0]*256 + presetdata[1])/2.90345;
	else
		temp = (presetdata[0]*256 + presetdata[1])/1.48975;
	if((temp-(int)temp)>0.5)
		inverter->protect_vl1 = (int)temp +1;
	else
		inverter->protect_vl1 = (int)temp;

	if(1 == ecu.type)
		temp = (presetdata[2]*256 + presetdata[3])/2.90345;
	else
		temp = (presetdata[2]*256 + presetdata[3])/1.48975;
	if((temp-(int)temp)>0.5)
		inverter->protect_vu1 = (int)temp +1;
	else
		inverter->protect_vu1 = (int)temp;*/

	/*
	if(1 == ecu.type)
		temp = (protect_data_result[4]*256 + protect_data_result[5])/2.90345;
	else
		temp = (protect_data_result[4]*256 + protect_data_result[5])/1.48975;
	if((temp-(int)temp)>0.5)
		inverter->protect_voltage_min = (int)temp +1;
	else
		inverter->protect_voltage_min = (int)temp;

	if(1 == ecu.type)
		temp = (protect_data_result[6]*256 + protect_data_result[7])/2.90345;
	else
		temp = (protect_data_result[6]*256 + protect_data_result[7])/1.48975;
	if((temp-(int)temp)>0.5)
		inverter->protect_voltage_max = (int)temp +1;
	else
		inverter->protect_voltage_max = (int)temp;

	if(1 == ecu.type)
		inverter->protect_frequency_min = 600-protect_data_result[8];
	else
		inverter->protect_frequency_min = 500-protect_data_result[8];
	if(1 == ecu.type)
		inverter->protect_frequency_max = 600+protect_data_result[9];
	else
		inverter->protect_frequency_max = 500+protect_data_result[9];
	inverter->recovery_time = protect_data_result[10]*256 + protect_data_result[11];
*/
	if((1==inverter->model)||(2==inverter->model)||(3==inverter->model)||(4==inverter->model))	//??????
		temp = (protect_data_result[3]*65536 + protect_data_result[4]*256 + protect_data_result[5])/26204.64;
	if((5==inverter->model)||(6==inverter->model))
		temp = (protect_data_result[3]*65536 + protect_data_result[4]*256 + protect_data_result[5])/11614.45;

	if((temp-(int)temp)>0.5)
		inverter->protect_voltage_min = (int)temp +1;
	else
		inverter->protect_voltage_min = (int)temp;

	if((1==inverter->model)||(2==inverter->model)||(3==inverter->model)||(4==inverter->model))	//??????
		temp = (protect_data_result[6]*65536 + protect_data_result[7]*256 + protect_data_result[8])/26204.64;
	if((5==inverter->model)||(6==inverter->model))
		temp = (protect_data_result[6]*65536 + protect_data_result[7]*256 + protect_data_result[8])/11614.45;
	if((temp-(int)temp)>0.5)
		inverter->protect_voltage_max = (int)temp +1;
	else
		inverter->protect_voltage_max = (int)temp;

	if((1==inverter->model)||(2==inverter->model)||(3==inverter->model)||(4==inverter->model))
		inverter->protect_frequency_min = 223750/(protect_data_result[9]*256 + protect_data_result[10]);
	if((5==inverter->model)||(6==inverter->model))
		inverter->protect_frequency_min = 256000/(protect_data_result[9]*256 + protect_data_result[10]);

	if((1==inverter->model)||(2==inverter->model)||(3==inverter->model)||(4==inverter->model))
		inverter->protect_frequency_max = 223750/(protect_data_result[11]*256 + protect_data_result[12]);
	if((5==inverter->model)||(6==inverter->model))
		inverter->protect_frequency_max = 256000/(protect_data_result[11]*256 + protect_data_result[12]);

	inverter->recovery_time = protect_data_result[13]*256 + protect_data_result[14];

	return 1;
}
/*
int process_protect_data(inverter_info *firstinverter)
{
	FILE *fp;
	int flag = 0;
	int i,j;
	char buff[256] = {'\0'};
	char protect_data_yc500_yc200[20]={0};		//??ECU??????????(????????????????)
	char protect_data_yc1000[20]={0};
	inverter_info *curinverter = firstinverter;
	char protect_data_DD_reply[256]={'\0'};


	fp = fopen("/tmp/presdata.con", "r");


	if(fp){
		fgets(buff, 255, fp);
		fclose(fp);
	}

	if(!strlen(buff))
		flag = 0;
	if('0' == buff[0])
		flag = 0;
	if('1' == buff[0])
		flag = 1;
	if('2' == buff[0])
		flag = 2;


	if(1 == flag)
	{

		get_protect_data_from_db(protect_data_yc500_yc200,protect_data_yc1000);

		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)
		{
			if(((1==curinverter->model)||(2==curinverter->model)||(3==curinverter->model)||(4==curinverter->model))&&(curinverter->model!=0))
			{
				for(j=0;j<3;j++)
				{
					if(1 == zb_set_protect_parameter(curinverter,protect_data_yc500_yc200))
					{
						print2msg("main","set_protect_parameter_successful", curinverter->id);

						if(1 == zb_query_protect_parameter(curinverter, protect_data_DD_reply))
						{
							resolve_and_update_inverter_protect_parameter(curinverter, &protect_data_DD_reply[4]);

							if(0 == compare_protect_data(protect_data_yc500_yc200, &protect_data_DD_reply[7]))	//????,???????????
							{
								print2msg("main","compare_protect_parameter_successful", curinverter->id);
								break;
							}

						}
					}
				}
			}
			else if(((5==curinverter->model)||(6==curinverter->model))&&(curinverter->model!=0))
			{
				for(j=0;j<3;j++)
				{
					if(1 == zb_set_protect_parameter(curinverter,protect_data_yc1000))
					{
						print2msg("main","set_protect_parameter_successful", curinverter->id);
						if(1 == zb_query_protect_parameter(curinverter, protect_data_DD_reply))
						{
							resolve_and_update_inverter_protect_parameter(curinverter, &protect_data_DD_reply[4]);
							if(0 == compare_protect_data(protect_data_yc1000, &protect_data_DD_reply[7]))		//????,???????????
							{
								print2msg("main","compare_protect_parameter_successful", curinverter->id);
								break;
							}
						}
					}
				}
			}
			else
			{
				;
			}
		}

		save_protect_result(firstinverter);

	//	query_protect_data_from_inverter(firstinverter, protect_data_yc500_yc200,protect_data_yc1000);
	//	display_protect_result(firstinverter);


		fp = fopen("/tmp/presdata.con", "w");
		fprintf(fp, "0");
		fclose(fp);
	}


	if(2 == flag)
	{
		if(1 == zb_query_protect_parameter(curinverter, protect_data_DD_reply))
		{
			resolve_and_update_inverter_protect_parameter(curinverter, &protect_data_DD_reply[4]);
		}

		save_protect_result(firstinverter);

		fp = fopen("/tmp/presdata.con", "w");
		fprintf(fp, "0");
		fclose(fp);
	}

