tomyqg/STM32_RTT_F107/ECU/main/src/zigbee.c
	fd = open("/TMP/IDNOBIND.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0); 	//为了统计显示有短地址但是没有绑定的逆变器ID
	if (fd >= 0) 
	{						

		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)
		{
			if((1!=curinverter->bindflag)&&(0!=curinverter->shortaddr))
			{
				memset(buff,0,50);
				sprintf(buff,"%s\n",curinverter->id);
				write(fd, buff, strlen(buff));
			}
		}
		close(fd);
	}

	fd = open("/TMP/SIGNALST.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0);
	if (fd >= 0) 
	{			
		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)	 //统计每天逆变器的信号强度, ZK
		{
			memset(buff,0,50);
			sprintf(buff, "%s%X\n", curinverter->id,curinverter->signalstrength);
			write(fd, buff, strlen(buff));

		}
		close(fd);
	}

	fd = open("/TMP/RADUIS.TXT", O_WRONLY | O_CREAT | O_TRUNC, 0);
	if (fd >= 0) 
	{			
		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==strlen(curinverter->id)); i++, curinverter++)	 //统计每台逆变器的信号强度, ZK
		{
			memset(buff,0,50);
			sprintf(buff, "%s%X\n", curinverter->id,curinverter->raduis);
			write(fd, buff, strlen(buff));
		}
		close(fd);
	}
	
	write_gfdi_status(firstinverter);
	write_turn_on_off_status(firstinverter);
	save_turn_on_off_changed_result(firstinverter);
	save_gfdi_changed_result(firstinverter);
	
	return ecu.count;
}

int get_inverter_shortaddress(inverter_info *firstinverter)		//获取没有数据的逆变器的短地址
{
	int i;
	inverter_info *curinverter = firstinverter;
	unsigned short current_panid;				//Zigbee即时的PANID
	int flag = 0;


	curinverter = firstinverter;
	for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
	{
		if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
		{
			flag=1;
			break;
		}
		curinverter++;
	}

	if(1==flag)
	{
		if(1==zb_restore_ecu_panid_0xffff(0x10))		//把ECU的PANID设置为默认的0xffff
			current_panid = 0xffff;
		printdecmsg("main","PANID",current_panid);
		rt_thread_delay(5*RT_TICK_PER_SECOND);


		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
		{
			if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
			{
				zb_change_inverter_panid_single(curinverter);		//把没有数据的逆变器PANID修改成ECU的PANID
				rt_hw_us_delay(500000);
			}
			curinverter++;
		}

		if(1==zb_change_ecu_panid())						//把ECU的panid改成此台ECU原本panid
			current_panid = ecu.panid;
		printdecmsg("main","PANID",current_panid);
		rt_thread_delay(5*RT_TICK_PER_SECOND);

		curinverter = firstinverter;
		for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
		{
			printdecmsg("main","no_getdata_num",curinverter->no_getdata_num);
			if((0==curinverter->shortaddr)||(curinverter->no_getdata_num>5))
			{
				zb_get_inverter_shortaddress_single(curinverter);
			}
			curinverter++;
		}
	}
	return 1;
}

int bind_nodata_inverter(inverter_info *firstinverter)		//绑定没有数据的逆变器,并且获取短地址
{
	int i;
	inverter_info *curinverter = firstinverter;

	curinverter = firstinverter;
	for(i=0; (i<MAXINVERTERCOUNT)&&(12==rt_strlen(curinverter->id)); i++)
	{
		if(curinverter->no_getdata_num>0)
		{
//			zb_turnoff_limited_rptid(curinverter->shortaddr,curinverter);
			zb_get_inverter_shortaddress_single(curinverter);
		}
		curinverter++;
	}
	return 0;
}

//单点改变逆变器的PANID为ECU的MAC地址后四位,信道为指定信道(注:需要将ECU的PANID改为0xFFFF(万能发送))
int zb_change_inverter_channel_one(char *inverter_id, int channel)
{
	char sendbuff[512] = {'\0'};
	int i;
	int check=0;

	clear_zbmodem();
	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x0F;
	sendbuff[5]  = 0x00;
	sendbuff[6]  = 0x00;
	sendbuff[7]  = ecu.panid>>8;
	sendbuff[8]  = ecu.panid;
	sendbuff[9]  = channel;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0xA0;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x06;
	sendbuff[15]=((inverter_id[0]-0x30)*16+(inverter_id[1]-0x30));
	sendbuff[16]=((inverter_id[2]-0x30)*16+(inverter_id[3]-0x30));
	sendbuff[17]=((inverter_id[4]-0x30)*16+(inverter_id[5]-0x30));
	sendbuff[18]=((inverter_id[6]-0x30)*16+(inverter_id[7]-0x30));
	sendbuff[19]=((inverter_id[8]-0x30)*16+(inverter_id[9]-0x30));
	sendbuff[20]=((inverter_id[10]-0x30)*16+(inverter_id[11]-0x30));
	ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 21);
	printhexmsg("main","Change Inverter Channel (one)", sendbuff, 21);

	rt_thread_delay(RT_TICK_PER_SECOND); //此处延时必须大于1S
	return 0;
}

//改变传入逆变器ID的信道
int zb_change_channel(int num, char **ids)
{
	int i, j;
	char ecu_channel[16];

	clear_zbmodem();
	ecu_channel[0] = 0x0B;
	ecu_channel[1] = 0x0C;
	ecu_channel[2] = 0x0D;
	ecu_channel[3] = 0x0E;
	ecu_channel[4] = 0x0F;
	ecu_channel[5] = 0x10;
	ecu_channel[6] = 0x11;
	ecu_channel[7] = 0x12;
	ecu_channel[8] = 0x13;
	ecu_channel[9] = 0x14;
	ecu_channel[10] = 0x15;
	ecu_channel[11] = 0x16;
	ecu_channel[12] = 0x17;
	ecu_channel[13] = 0x18;
	ecu_channel[14] = 0x19;
	ecu_channel[15] = 0x1A;

	//改变每台逆变器的信道
	for (i=0; i<16; i++) {
		zb_restore_ecu_panid_0xffff(ecu_channel[i]); //改变ECU信道
		for (j=1; j<=num; j++) {
			if (RT_NULL != ids[j] && rt_strlen(ids[j])) {
				print2msg("main","inverter", ids[j]);
				zb_change_inverter_channel_one(ids[j], ecu.channel);
			}
		}
	}

	//设置ECU信道为配置文件中的信道
	zb_change_ecu_panid();

	return 0;
}


//还原逆变器信道
int zb_reset_channel(int num, char **ids)
{
	int i, j;
	char ecu_channel[16];

	clear_zbmodem();
	ecu_channel[0] = 0x0B;
	ecu_channel[1] = 0x0C;
	ecu_channel[2] = 0x0D;
	ecu_channel[3] = 0x0E;
	ecu_channel[4] = 0x0F;
	ecu_channel[5] = 0x10;
	ecu_channel[6] = 0x11;
	ecu_channel[7] = 0x12;
	ecu_channel[8] = 0x13;
	ecu_channel[9] = 0x14;
	ecu_channel[10] = 0x15;
	ecu_channel[11] = 0x16;
	ecu_channel[12] = 0x17;
	ecu_channel[13] = 0x18;
	ecu_channel[14] = 0x19;
	ecu_channel[15] = 0x1A;

	//还原每台逆变器的信道
	for (i=0; i<16; i++) {
		zb_restore_ecu_panid_0xffff(ecu_channel[i]); //改变ECU信道
		for (j=1; j<=num; j++) {
			if (RT_NULL != ids[j] && rt_strlen(ids[j])) {
				print2msg("main","inverter", ids[j]);
				zb_change_inverter_channel_one(ids[j], 0x10);
			}
		}
	}

	//设置ECU的信道为默认信道
	ecu.channel = 0x10;
	zb_change_ecu_panid();

