tomyqg/STM32_RTT_F107/ECU/main/src/zigbee.c
	return 0;
}

//关闭逆变器ID上报 + 绑定逆变器
int zb_off_report_id_and_bind(int short_addr)
{
	int times = 3;
	char sendbuff[16] = {'\0'};
	char recvbuff[256] = {'\0'};
	int i;
	int check=0;

	do {
		//发送关闭逆变器ID上报+绑定操作
		clear_zbmodem();
		sendbuff[0]  = 0xAA;
		sendbuff[1]  = 0xAA;
		sendbuff[2]  = 0xAA;
		sendbuff[3]  = 0xAA;
		sendbuff[4]  = 0x08;
		sendbuff[5]  = short_addr>>8;
		sendbuff[6]  = short_addr;
		sendbuff[7]  = 0x00; //PANID(逆变器不解析)
		sendbuff[8]  = 0x00; //PANID(逆变器不解析)
		sendbuff[9]  = 0x00; //信道(逆变器不解析)
		sendbuff[10] = 0x00; //功率(逆变器不解析)
		sendbuff[11] = 0xA0;
		for(i=4;i<12;i++)
			check=check+sendbuff[i];
		sendbuff[12] = check/256;
		sendbuff[13] = check%256;
		sendbuff[14] = 0x00;
		ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 15);
		printhexmsg("main","Bind ZigBee", sendbuff, 15);

		//接收逆变器应答(短地址,ZigBee版本号,信号强度)
		if ((11 == zb_get_reply_from_module(recvbuff))
				&& (0xA5 == recvbuff[2])
				&& (0xA5 == recvbuff[3])) {
			//update_turned_off_rpt_flag(short_addr, (int)recvbuff[9]);
			//update_bind_zigbee_flag(short_addr);
			printmsg("main","Bind Successfully");
			return 1;
		}
	}while(--times);

	return 0;
}

int zigbeeRecvMsg(char *data, int timeout_sec)
{
	int count;
	if (selectZigbee(timeout_sec) <= 0) {
		printmsg("main","Get reply time out");
		return -1;
	} else {
		
		count = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data, 255);
		printhexmsg("main","Reply", data, count);
		return count;
	}
}


#ifdef RT_USING_FINSH
#include <finsh.h>
FINSH_FUNCTION_EXPORT(zigbee_reset, reset zigbee module.)
void Zbtestcomm()		//测试通信
{
	zb_test_communication();
}
FINSH_FUNCTION_EXPORT(Zbtestcomm,zigbee test communication.)

void Zbecupanidffff(int channel)		//设置ECU panid为ffff 信道为channel
{
	zb_restore_ecu_panid_0xffff(channel);
}
FINSH_FUNCTION_EXPORT(Zbecupanidffff,zb_restore_ecu_panid_0xffff channel[int].)
	
void Zbecupanid()		//设置ECU panid 以及 信道   为ECU全局变量的值	
{
	zb_change_ecu_panid();
}
FINSH_FUNCTION_EXPORT(Zbecupanid,zb_change_ecu_panid.)

void Zbecupanid8888(int channel)	//设置ECU panid为0x8888  信道我ECU全局变量的值
{
	zb_restore_ecu_panid_0x8888();
}
FINSH_FUNCTION_EXPORT(Zbecupanid8888,zb_restore_ecu_panid_0x8888.)

void Zbinvchone(char *inverter_id, int channel)	//更改逆变器panid和信道 其中panid为全局变量ecu的信道
{
	zb_change_inverter_channel_one(inverter_id,channel);
}
FINSH_FUNCTION_EXPORT(Zbinvchone,zb_change_inverter_channel_one inverter_id[char *12] channel[int].)

void Zbgetshadd(char *inverter_id)	//获取逆变器短地址
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	zb_get_inverter_shortaddress_single(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetshadd,zb_get_inverter_shortaddress_single inverter_id[char *12].)

void Zbgetdata(char *inverter_id)	//获取数据
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	inverter.model = 7;
	zb_get_inverter_shortaddress_single(&inverter);
	zb_query_data(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetdata,zb_query_data inverter_id[char *12].)
#endif
